In [25]:
import pandas as pd

In [27]:
datos = {"nombre":["juan","alberto","lorena"],"edad":[25,28,35]}
datos

{'nombre': ['juan', 'alberto', 'lorena'], 'edad': [25, 28, 35]}

In [29]:
df = pd.DataFrame(datos)
df

    nombre  edad
0     juan    25
1  alberto    28
2   lorena    35

In [31]:
df['nombre']

0       juan
1    alberto
2     lorena
Name: nombre, dtype: object

In [33]:
df.nombre

0       juan
1    alberto
2     lorena
Name: nombre, dtype: object

In [35]:
type(df.nombre)

pandas.core.series.Series